In [2]:
# One-time setup
!mkdir -p "$HOME/spider_eval"
!cp "$HOME/evaluation.py" "$HOME/spider_eval/"
!cp "$HOME/process_sql.py" "$HOME/spider_eval/"
!ls -lh "$HOME/spider_eval"

!"$HOME/t2sql-env/bin/pip" install -q nltk
!"$HOME/t2sql-env/bin/python" - <<'PY'
import nltk; nltk.download('punkt')
print("NLTK punkt downloaded.")

total 52K
drwxr-xr-x 2 sagemaker-user users  41 Oct 17 01:20 __pycache__
-rw-r--r-- 1 sagemaker-user users 30K Oct 17 04:12 evaluation.py
-rw-r--r-- 1 sagemaker-user users 17K Oct 17 04:12 process_sql.py
/bin/bash: line 1: warning: here-document at line 1 delimited by end-of-file (wanted `PY')
NLTK punkt downloaded.

[nltk_data] Downloading package punkt to /home/sagemaker-
[nltk_data]     user/nltk_data...
[nltk_data]   Package punkt is already up-to-date!

In [3]:
!mkdir -p "$HOME/"
!unzip -q -o "$HOME/spider_data.zip" -d "$HOME/"

In [4]:
import os, nltk
os.environ["NLTK_DATA"] = os.path.expanduser("~/nltk_data")
os.makedirs(os.environ["NLTK_DATA"], exist_ok=True)

nltk.download("punkt")       # classic sentence/word tokenizer
nltk.download("punkt_tab")   # extra tables required by NLTK>=3.9

print("NLTK data dir:", os.environ["NLTK_DATA"])

NLTK data dir: /home/sagemaker-user/nltk_data

[nltk_data] Downloading package punkt to /home/sagemaker-
[nltk_data]     user/nltk_data...
[nltk_data]   Package punkt is already up-to-date!
[nltk_data] Downloading package punkt_tab to /home/sagemaker-
[nltk_data]     user/nltk_data...
[nltk_data]   Package punkt_tab is already up-to-date!

In [6]:
# 0) make sure we're using the venv's pip
!"$HOME/t2sql-env/bin/python" -m pip install -q --upgrade pip

# 1) if you previously installed a conflicting multiprocess, remove it
!"$HOME/t2sql-env/bin/pip" uninstall -y multiprocess || true

# 2) install a known-good, minimal stack (no multiprocess pin; datasets pulls a compatible one)
!"$HOME/t2sql-env/bin/pip" install -q \
  "transformers==4.44.2" \
  "datasets==2.19.0" \
  "peft==0.12.0" \
  "accelerate==0.33.0" \
  sentencepiece \
  "pyarrow==19.0.0"

# 3) confirm versions actually installed inside the venv
!"$HOME/t2sql-env/bin/python" - <<'PY'
import transformers, datasets, peft, accelerate, pyarrow, sys
import multiprocess
print("Python:", sys.version)
print("transformers:", transformers.__version__)
print("datasets:", datasets.__version__)
print("peft:", peft.__version__)
print("accelerate:", accelerate.__version__)
print("pyarrow:", pyarrow.__version__)
print("multiprocess:", multiprocess.__version__)

Found existing installation: multiprocess 0.70.16
Uninstalling multiprocess-0.70.16:
  Successfully uninstalled multiprocess-0.70.16
/bin/bash: line 1: warning: here-document at line 1 delimited by end-of-file (wanted `PY')

/home/sagemaker-user/t2sql-env/lib/python3.12/site-packages/tqdm/auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

Python: 3.12.9 | packaged by conda-forge | (main, Feb 14 2025, 08:00:06) [GCC 13.3.0]
transformers: 4.44.2
datasets: 2.19.0
peft: 0.12.0
accelerate: 0.33.0
pyarrow: 19.0.0
multiprocess: 0.70.16

In [17]:
import json, os

HOME = os.path.expanduser("~")
DATA_DIR = os.path.join(HOME, "text2sql_data")
DEV_JSON = os.path.join(DATA_DIR, "dev.json")
EVAL_DIR = os.path.join(HOME, "text2sql_outputs", "spider_eval")
os.makedirs(EVAL_DIR, exist_ok=True)

with open(DEV_JSON, "r", encoding="utf-8") as f:
    dev = json.load(f)

gold_path = os.path.join(EVAL_DIR, "gold.tsv")
with open(gold_path, "w", encoding="utf-8") as g:
    for ex in dev:
        g.write(f"{ex['query']}\t{ex['db_id']}\n")

print("Wrote gold.tsv:", gold_path, "rows:", len(dev))

Wrote gold.tsv: /home/sagemaker-user/text2sql_outputs/spider_eval/gold.tsv rows: 1034

In [18]:
import os, json, torch
from transformers import AutoTokenizer, AutoModelForSeq2SeqLM
from peft import PeftModel

HOME = os.path.expanduser("~")
OUT_DIR = os.path.join(HOME, "text2sql_outputs")
DATA_DIR = os.path.join(HOME, "text2sql_data")
DEV_JSON = os.path.join(DATA_DIR, "dev.json")
TABLES_JSON = os.path.join(DATA_DIR, "tables.json")
EVAL_DIR = os.path.join(OUT_DIR, "spider_eval")
adapters_dir = os.path.join(OUT_DIR, "lora_adapters")

with open(DEV_JSON, "r", encoding="utf-8") as f: dev = json.load(f)
with open(TABLES_JSON, "r", encoding="utf-8") as f: tables = json.load(f)

# build compact schema text like training (same caps you used)
def build_schema_texts(tables_json, keep_db_ids=None, cap_cols=6, cap_fks=6):
    out={}
    for db in tables_json:
        dbid=db["db_id"]
        if keep_db_ids and dbid not in keep_db_ids: continue
        names=db["table_names_original"]; cols=db["column_names_original"]
        pks=set(db["primary_keys"]); fks=db["foreign_keys"]
        per={i:[] for i in range(len(names))}
        for idx,(t_idx,c_name) in enumerate(cols):
            if t_idx==-1: continue
            tag=" PK" if idx in pks else ""
            per[t_idx].append(f"{c_name}{tag}")
        fk_lines=[]
        for a,b in fks:
            ct,cc=cols[a]; pt,pc=cols[b]
            if ct==-1 or pt==-1: continue
            fk_lines.append(f"{names[ct]}.{cc}->{names[pt]}.{pc}")
        lines=[f"DB: {dbid}","Tables:"]
        for i,t in enumerate(names):
            c=", ".join(per[i][:cap_cols])
            if len(per[i])>cap_cols: c+=", ..."
            lines.append(f"- {t}({c})")
        if fk_lines:
            fk_show="; ".join(fk_lines[:cap_fks])+(";" if len(fk_lines)>cap_fks else "")
            lines.append("FKs: "+fk_show)
        out[dbid]="\n".join(lines)
    return out

schema_texts = build_schema_texts(tables, set(ex["db_id"] for ex in dev), cap_cols=6, cap_fks=6)

tok = AutoTokenizer.from_pretrained("google/flan-t5-base")
base = AutoModelForSeq2SeqLM.from_pretrained("google/flan-t5-base")
model = PeftModel.from_pretrained(base, adapters_dir).eval()
device = torch.device("cuda" if torch.cuda.is_available() else "cpu")
model.to(device)

pred_path = os.path.join(EVAL_DIR, "pred.txt")
with open(pred_path, "w", encoding="utf-8") as p:
    for ex in dev:
        q, dbid = ex["question"], ex["db_id"]
        schema = schema_texts.get(dbid, f"DB: {dbid}\nTables:")
        prompt = f"translate to sql: {q}\n{schema}"
        enc = tok(prompt, return_tensors="pt", max_length=512, truncation=True).to(device)
        with torch.no_grad():
            out = model.generate(
                **enc, max_new_tokens=160, num_beams=5,
                no_repeat_ngram_size=3, length_penalty=0.8,
                early_stopping=True, do_sample=False,
                eos_token_id=tok.eos_token_id
            )
        sql = tok.decode(out[0], skip_special_tokens=True).strip()
        p.write(sql + "\n")

print("Wrote pred.txt:", pred_path, "rows:", len(dev))

Wrote pred.txt: /home/sagemaker-user/text2sql_outputs/spider_eval/pred.txt rows: 1034

In [19]:
import os, subprocess, shlex
HOME = os.path.expanduser("~")
EVAL_PY = os.path.join(HOME, "spider_eval", "evaluation.py")
TABLES_JSON = os.path.join(HOME, "text2sql_data", "tables.json")
SPIDER_DB_DIR = os.path.join(HOME, "spider_data", "database")  # your DB path
EVAL_DIR = os.path.join(HOME, "text2sql_outputs", "spider_eval")
gold_path = os.path.join(EVAL_DIR, "gold.tsv")
pred_path = os.path.join(EVAL_DIR, "pred.txt")

use_exec = os.path.isdir(SPIDER_DB_DIR)
etype = "all" if use_exec else "match"

cmd = (
    f'python "{EVAL_PY}" '
    f'--gold "{gold_path}" '
    f'--pred "{pred_path}" '
    f'--table "{TABLES_JSON}" '
    f'--etype {etype} ' + (f'--db "{SPIDER_DB_DIR}"' if use_exec else "")
)
print("Running:\n", cmd, "\n")
res = subprocess.run(shlex.split(cmd), capture_output=True, text=True)
print(res.stdout)
if res.stderr: print("STDERR:\n", res.stderr)

Running:
 python "/home/sagemaker-user/spider_eval/evaluation.py" --gold "/home/sagemaker-user/text2sql_outputs/spider_eval/gold.tsv" --pred "/home/sagemaker-user/text2sql_outputs/spider_eval/pred.txt" --table "/home/sagemaker-user/text2sql_data/tables.json" --etype all --db "/home/sagemaker-user/spider_data/database"

medium pred: SELECT name, country, age FROM singer ORDER BY age ASC
medium gold: SELECT name ,  country ,  age FROM singer ORDER BY age DESC

eval_err_num:1
medium pred: SELECT avg(Singer_ID), min(Serge_ID), max(Age) FROM singer WHERE Country = "France"
medium gold: SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'

eval_err_num:2
medium pred: SELECT avg(Singer_ID), min(Serge_ID), max(Age) FROM singer WHERE country = 'France'
medium gold: SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'

medium pred: SELECT Song_Name, Song_release_year FROM singer ORDER BY Age DESC LIMIT 1
medium gold: SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1

medium pred: SELECT Song_Name, Song_release_year FROM singer ORDER BY Age DESC LIMIT 1
medium gold: SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1

eval_err_num:3
hard pred: SELECT song_name FROM singer WHERE age > (SELECT avg(age) FROM singer_in_concert)
hard gold: SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)

eval_err_num:4
medium pred: SELECT LOCATION, Name FROM stadium WHERE Capacity > 5000 AND 10000
medium gold: SELECT LOCATION ,  name FROM stadium WHERE capacity BETWEEN 5000 AND 10000

eval_err_num:5
medium pred: SELECT maximum, avg(capacity) FROM stadium
medium gold: select max(capacity), average from stadium

eval_err_num:6
medium pred: SELECT avg(capacity), max(capability) FROM stadium
medium gold: select avg(capacity) ,  max(capacity) from stadium

medium pred: SELECT name, capacity FROM stadium ORDER BY count(*) DESC LIMIT 1
medium gold: SELECT name ,  capacity FROM stadium ORDER BY average DESC LIMIT 1

eval_err_num:7
medium pred: SELECT name, capacity FROM stadium ORDER BY avg(attendance) DESC LIMIT 1
medium gold: SELECT name ,  capacity FROM stadium ORDER BY average DESC LIMIT 1

eval_err_num:8
medium pred: SELECT name, count(*) FROM concert GROUP BY name
medium gold: SELECT T2.name ,  count(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id GROUP BY T1.stadium_id

medium pred: SELECT Stadium_ID, count(*) FROM concert GROUP BY Stadium_id
medium gold: SELECT T2.name ,  count(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id GROUP BY T1.stadium_id

eval_err_num:9
extra pred: SELECT Name, Capacity FROM concert WHERE YEAR > 2014 OR YEAR = 2014
extra gold: SELECT T2.name ,  T2.capacity FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  >=  2014 GROUP BY T2.stadium_id ORDER BY count(*) DESC LIMIT 1

eval_err_num:10
extra pred: SELECT name, capacity FROM stadium WHERE YEAR > 2013 GROUP BY name ORDER BY count(*) DESC LIMIT 1
extra gold: select t2.name ,  t2.capacity from concert as t1 join stadium as t2 on t1.stadium_id  =  t2.stadium_id where t1.year  >  2013 group by t2.stadium_id order by count(*) desc limit 1

hard pred: SELECT year FROM concert ORDER BY count(*) DESC LIMIT 1
hard gold: SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT YEAR FROM concert ORDER BY count(*) DESC LIMIT 1
hard gold: SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1

eval_err_num:11
hard pred: SELECT Country FROM singer WHERE Age > 40 AND Age  30
hard gold: SELECT country FROM singer WHERE age  >  40 INTERSECT SELECT country FROM singer WHERE age  <  30

eval_err_num:12
hard pred: SELECT name FROM stadium WHERE YEAR = 2014
hard gold: SELECT name FROM stadium EXCEPT SELECT T2.name FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  =  2014

eval_err_num:13
hard pred: SELECT T1.Name FROM stadium AS T1 JOIN concert AS T2 ON T1.Stadium_ID = T2.State_ID WHERE T2.Year = 2014
hard gold: SELECT name FROM stadium EXCEPT SELECT T2.name FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  =  2014

medium pred: SELECT concert_name, Theme, count(*) FROM concert GROUP BY concert_Name
medium gold: SELECT T2.concert_name ,  T2.theme ,  count(*) FROM singer_in_concert AS T1 JOIN concert AS T2 ON T1.concert_id  =  T2.concert_id GROUP BY T2.concert_id

medium pred: SELECT concert_name, theme, count(*) FROM concert
medium gold: select t2.concert_name ,  t2.theme ,  count(*) from singer_in_concert as t1 join concert as t2 on t1.concert_id  =  t2.concert_id group by t2.concert_id

eval_err_num:14
medium pred: SELECT name, count(*) FROM singer_in_concert GROUP BY name
medium gold: SELECT T2.name ,  count(*) FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id GROUP BY T2.singer_id

eval_err_num:15
medium pred: SELECT name, count(*) FROM singer_in_concert GROUP BY name
medium gold: SELECT T2.name ,  count(*) FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id GROUP BY T2.singer_id

eval_err_num:16
hard pred: SELECT name FROM concert WHERE YEAR = 2014
hard gold: SELECT T2.name FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id JOIN concert AS T3 ON T1.concert_id  =  T3.concert_id WHERE T3.year  =  2014

eval_err_num:17
hard pred: SELECT name FROM singer_in_concert WHERE YEAR = 2014
hard gold: SELECT T2.name FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id JOIN concert AS T3 ON T1.concert_id  =  T3.concert_id WHERE T3.year  =  2014

eval_err_num:18
extra pred: SELECT T1.Name, T1.Location FROM concert AS T1 JOIN stadium AS T2 ON T1.Stadium_ID = T2.Status_ID WHERE T2.Year = 2014 AND T2.year = 2015
extra gold: SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015

eval_err_num:19
extra pred: SELECT T1.Name, T1.Location FROM stadium AS T1 JOIN concert AS T2 ON T1.Stadium_ID = T2.State_ID WHERE T2.Year = 2014 AND T2.year = 2015
extra gold: SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015

eval_err_num:20
hard pred: SELECT count(*) FROM concert ORDER BY capacity DESC LIMIT 1
hard gold: select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)

eval_err_num:21
hard pred: SELECT count(*) FROM concert ORDER BY capacity DESC LIMIT 1
hard gold: select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)

medium pred: SELECT weight FROM pets ORDER BY pet_age DESC LIMIT 1
medium gold: SELECT weight FROM pets ORDER BY pet_age LIMIT 1

eval_err_num:22
medium pred: SELECT weight FROM pets WHERE pet_age = (SELECT max(age) FROM pets)
medium gold: SELECT weight FROM pets ORDER BY pet_age LIMIT 1

medium pred: SELECT count(*) FROM Student WHERE age > 20
medium gold: SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20

medium pred: SELECT count(*) FROM Student WHERE age > 20
medium gold: SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20

eval_err_num:23
hard pred: SELECT count(*) FROM pets AS T1 JOIN student AS T2 ON T1.StuID = T2.StuID WHERE T2.sex = "F"
hard gold: SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'

hard pred: SELECT count(*) FROM Student WHERE sex = 'F'
hard gold: SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'

eval_err_num:24
extra pred: SELECT Fname FROM Student WHERE Pettype = "Cat" OR PetType = "Dog"
extra gold: SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'

eval_err_num:25
extra pred: SELECT T1.Fname FROM Student AS T1 JOIN Has_Pet AS T2 ON T1.StuID = T2.StuID WHERE T2. Pettype = 'Cat' OR T2.PeptType = "Dog"
extra gold: SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'

eval_err_num:26
extra pred: SELECT T1.Fname FROM Student AS T1 JOIN Has_Pet AS T2 ON T1.StuID = T2.StuID WHERE T2. Pettype = 'Cat' AND T2.PetalType = "Dog"
extra gold: select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'cat' intersect select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'dog'

eval_err_num:27
extra pred: SELECT T1.fname FROM Student AS T1 JOIN Has_Pet AS T2 ON T1.StuID = T2.StuID WHERE T2.pettype = 'Cat' AND T1.pet_age = "Dogs"
extra gold: SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog'

extra pred: SELECT major, age FROM STUDENT WHERE StuID NOT IN (SELECT T1.StuID FROM Has_Pet AS T1 JOIN Student AS T2 ON T1.StuID = T2.StuID)
extra gold: SELECT major ,  age FROM student WHERE stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')

eval_err_num:28
extra pred: SELECT Major, Age FROM Student WHERE Student NOT IN (SELECT StuID FROM Has_Pet)
extra gold: SELECT major ,  age FROM student WHERE stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')

eval_err_num:29
hard pred: SELECT StuID FROM Has_Pet WHERE PetType = "Cat"
hard gold: SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'

eval_err_num:30
hard pred: SELECT StuID FROM Has_Pet WHERE PetType = "Cat"
hard gold: SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'

eval_err_num:31
extra pred: SELECT T1.fname, T1.age FROM Student AS T1 JOIN Has_Pet AS T2 ON T1.StuID = T2.StuID WHERE T2.pet_age!= 'Cat'
extra gold: SELECT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog' AND T1.stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')

eval_err_num:32
extra pred: SELECT T1.Fname FROM Student AS T1 JOIN Has_Pet AS T2 ON T1.StuID = T2.StuID WHERE T2.LName = "Dog" AND T2.Sex = "Cat"
extra gold: SELECT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog' AND T1.stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')

eval_err_num:33
medium pred: SELECT pet_type, weight FROM pets ORDER BY pet_age DESC LIMIT 1
medium gold: SELECT pettype ,  weight FROM pets ORDER BY pet_age LIMIT 1

medium pred: SELECT PetType, Weight FROM Pets GROUP BY PetType ORDER BY Weight DESC LIMIT 1
medium gold: SELECT pettype ,  weight FROM pets ORDER BY pet_age LIMIT 1

eval_err_num:34
medium pred: SELECT pet_id, weight FROM pets WHERE pet_age > 1
medium gold: SELECT petid ,  weight FROM pets WHERE pet_age  >  1

eval_err_num:35
medium pred: SELECT pet_id, weight FROM Pets WHERE pet_age > 1
medium gold: SELECT petid ,  weight FROM pets WHERE pet_age  >  1

eval_err_num:36
medium pred: SELECT pet_age, max(pet_age) FROM Pets GROUP BY pet_type
medium gold: SELECT avg(pet_age) ,  max(pet_age) ,  pettype FROM pets GROUP BY pettype

eval_err_num:37
medium pred: SELECT avg(pet_age), max(pettype) FROM Pets GROUP BY pet_type
medium gold: SELECT avg(pet_age) ,  max(pet_age) ,  pettype FROM pets GROUP BY pettype

eval_err_num:38
medium pred: SELECT T1.fname, T1.age FROM Student AS T1 JOIN Has_Pet AS T2 ON T1.StuID = T2.StuID WHERE T2.pet_age = "pet"
medium gold: SELECT DISTINCT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid

eval_err_num:39
medium pred: SELECT StuID FROM Has_Pet WHERE LName = 'Smith'
medium gold: SELECT T2.petid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.Lname  =  'Smith'

eval_err_num:40
medium pred: SELECT StuID FROM Has_Pet WHERE LName = 'Smith'
medium gold: SELECT T2.petid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.Lname  =  'Smith'

medium pred: SELECT count(*), StuID FROM Has_Pet GROUP BY StuId
medium gold: SELECT count(*) ,  T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid

medium pred: SELECT StuID, count(*) FROM Has_Pet GROUP BY StuId
medium gold: select count(*) ,  t1.stuid from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid group by t1.stuid

medium pred: SELECT fname, sex FROM Student WHERE StuID > 1
medium gold: SELECT T1.fname ,  T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid HAVING count(*)  >  1

eval_err_num:41
medium pred: SELECT T1.Fname, T1.Sex FROM Student AS T1 JOIN Has_Pet AS T2 ON T1.StuID = T2.StuID GROUP BY T2.Sex HAVING count(*) > 1
medium gold: SELECT T1.fname ,  T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid HAVING count(*)  >  1

eval_err_num:42
hard pred: SELECT T1.LName FROM Student AS T1 JOIN Has_Pet AS T2 ON T1.StuID = T2.StuID WHERE T2.age = 3
hard gold: SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pet_age  =  3 AND T3.pettype  =  'cat'

hard pred: SELECT LName FROM Student WHERE Age = 3
hard gold: SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pet_age  =  3 AND T3.pettype  =  'cat'

eval_err_num:43
extra pred: SELECT avg(age) FROM Student WHERE StuID NOT IN (SELECT Student FROM Has_Pet)
extra gold: select avg(age) from student where stuid not in (select stuid from has_pet)

eval_err_num:44
extra pred: SELECT avg(age) FROM Student WHERE StuID NOT IN (SELECT Student FROM Has_Pet)
extra gold: select avg(age) from student where stuid not in (select stuid from has_pet)

eval_err_num:45
medium pred: SELECT continent, countryname, count(*) FROM continents GROUP BY continent
medium gold: SELECT T1.ContId ,  T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.Continent GROUP BY T1.ContId;

eval_err_num:46
medium pred: SELECT continent, countryname, count(*) FROM continents GROUP BY continent
medium gold: SELECT T1.ContId ,  T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.Continent GROUP BY T1.ContId;

eval_err_num:47
medium pred: SELECT T1.FullName, T2.Id, COUNT(*) FROM car_makers AS T1 JOIN model_list AS T2 ON T1.Id = T2.MakeId GROUP BY T1.Makeid
medium gold: SELECT T1.FullName ,  T1.Id ,  count(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker GROUP BY T1.Id;

medium pred: SELECT FullName, Maker, COUNT(*) FROM car_makers GROUP BY Maker
medium gold: SELECT T1.FullName ,  T1.Id ,  count(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker GROUP BY T1.Id;

eval_err_num:48
hard pred: SELECT model FROM cars_data GROUP BY model ORDER BY horsepower ASC LIMIT 1
hard gold: SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id ORDER BY T2.horsepower ASC LIMIT 1;

eval_err_num:49
hard pred: SELECT Model FROM cars_data ORDER BY Horsepower LIMIT 1
hard gold: SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id ORDER BY T2.horsepower ASC LIMIT 1;

eval_err_num:50
extra pred: SELECT model FROM car_names WHERE weight  (SELECT avg(weight) FROM cars_data)
extra gold: SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T2.Weight  <  (SELECT avg(Weight) FROM CARS_DATA)

eval_err_num:51
extra pred: SELECT model FROM cars_data WHERE weight  (SELECT avg(weight) FROM car_names)
extra gold: SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T2.Weight  <  (SELECT avg(Weight) FROM CARS_DATA)

eval_err_num:52
extra pred: SELECT T1.FullName FROM car_makers AS T1 JOIN car_names AS T2 ON T1.Id = T2.MakeId WHERE T2.Year = 1970
extra gold: SELECT DISTINCT T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker JOIN CAR_NAMES AS T3 ON T2.model  =  T3.model JOIN CARS_DATA AS T4 ON T3.MakeId  =  T4.id WHERE T4.year  =  '1970';

eval_err_num:53
extra pred: SELECT DISTINCT T1.FullName FROM car_makers AS T1 JOIN car_names AS T2 ON T1.Id = T2.MakeId WHERE T2.Continent = 1970
extra gold: SELECT DISTINCT T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker JOIN CAR_NAMES AS T3 ON T2.model  =  T3.model JOIN CARS_DATA AS T4 ON T3.MakeId  =  T4.id WHERE T4.year  =  '1970';

eval_err_num:54
extra pred: SELECT T1.make, T1.production_time FROM car_names AS T1 JOIN model_list AS T2 ON T1.id = T2.model_id ORDER BY T2.year DESC LIMIT 1
extra gold: SELECT T2.Make ,  T1.Year FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T1.Year  =  (SELECT min(YEAR) FROM CARS_DATA);

eval_err_num:55
extra pred: SELECT Maker, YEAR FROM car_makers GROUP BY Maker ORDER BY YEAR DESC LIMIT 1
extra gold: SELECT T2.Make ,  T1.Year FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T1.Year  =  (SELECT min(YEAR) FROM CARS_DATA);

hard pred: SELECT DISTINCT Model FROM car_names WHERE Make > 1980
hard gold: SELECT DISTINCT T1.model FROM MODEL_LIST AS T1 JOIN CAR_NAMES AS T2 ON T1.model  =  T2.model JOIN CARS_DATA AS T3 ON T2.MakeId  =  T3.id WHERE T3.year  >  1980;

hard pred: SELECT DISTINCT Model FROM car_names WHERE Make > 1980
hard gold: SELECT DISTINCT T1.model FROM MODEL_LIST AS T1 JOIN CAR_NAMES AS T2 ON T1.model  =  T2.model JOIN CARS_DATA AS T3 ON T2.MakeId  =  T3.id WHERE T3.year  >  1980;

eval_err_num:56
hard pred: SELECT continent, count(*) FROM car_makers GROUP BY continent
hard gold: SELECT T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.continent JOIN car_makers AS T3 ON T2.CountryId  =  T3.Country GROUP BY T1.Continent;

hard pred: SELECT continent, count(*) FROM continents GROUP BY continent
hard gold: SELECT T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.continent JOIN car_makers AS T3 ON T2.CountryId  =  T3.Country GROUP BY T1.Continent;

eval_err_num:57
extra pred: SELECT CountryName FROM car_makers GROUP BY CountryName ORDER BY count(*) DESC LIMIT 1
extra gold: SELECT T2.CountryName FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country  =  T2.CountryId GROUP BY T1.Country ORDER BY Count(*) DESC LIMIT 1;

eval_err_num:58